export const REGISTRANTS = ["将哉", "未有"] as const;

export const EXPENSE_SOURCES = ["将哉(現金)", "ｸﾚｼﾞｯﾄ", "未有"] as const;

export const CATEGORIES = [
"食費",
"光熱費",
"消耗品",
"車",
"娯楽費",
"会社",
"子供",
"医療費",
"固定費",
"その他",
"積立",
"振替",
] as const;

export const SUBCATEGORIES: Record<(typeof CATEGORIES)[number], string[]> = {
食費: ["食材", "外食", "コンビニ", "自由入力"],
光熱費: ["電気", "ガス", "水道", "灯油", "自由入力"],
消耗品: ["ダイソー", "薬局", "ドンキ", "自由入力"],
車: ["ガソリン", "高速", "駐車場", "洗車", "オイル交換", "自由入力"],
娯楽費: ["将哉","未有", "自由入力"],
会社: ["諸会費", "斡旋", "試験", "飲み", "慶弔費", "交通費", "スーツ", "文房具", "自由入力"],
子供: ["病院", "アカホ", "保育園", "自由入力"],
医療費: ["病院", "自由入力"],
固定費: ["家賃", "携帯", "保険", "美容院", "奨学金", "マツパ", "新聞", "サブスク","ローン", "自由入力"],
その他: ["その他", "自由入力"],
積立: ["その他", "自由入力"],
振替: ["ATM（現金 −）", "ATM（口振 ＋）"],
};